{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "from tqdm.notebook import tqdm\n",
    "import pandas as pd\n",
    "import time\n",
    "from tqdm.notebook import tqdm\n",
    "import pickle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\", agent=\"Chrome/87.0 (Ismail.Harrando@eurecom.fr) SPARQLWrapper\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "classes = {\n",
    "    \"Organization\": \"Q43229\", #includes companies\n",
    "    \"Name\": \"Q82799\",\n",
    "    \"Artist\": \"Q483501\",\n",
    "    \"Geolocation\": \"Q2221906\",\n",
    "    \"City\": \"Q515\",\n",
    "    \"Capital\": \"Q5119\",\n",
    "    \"Town\": \"Q3957\",\n",
    "    \"Demonym\": \"Q217438\",\n",
    "    \"Product\": \"Q2424752\",\n",
    "    \"Brand\": \"Q431289\",\n",
    "    \"Georegion\": \"Q82794\",\n",
    "    \"Country\": \"Q6256\",\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(classes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "268ed6ecb17140d3937ebea901000e56",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=12.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Organization Q43229\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q43229.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "20000 of results returned at offset 2\n",
      "20000 of results returned at offset 3\n",
      "20000 of results returned at offset 4\n",
      "20000 of results returned at offset 5\n",
      "20000 of results returned at offset 6\n",
      "20000 of results returned at offset 7\n",
      "20000 of results returned at offset 8\n",
      "20000 of results returned at offset 9\n",
      "20000 of results returned at offset 10\n",
      "20000 of results returned at offset 11\n",
      "20000 of results returned at offset 12\n",
      "20000 of results returned at offset 13\n",
      "20000 of results returned at offset 14\n",
      "20000 of results returned at offset 15\n",
      "20000 of results returned at offset 16\n",
      "20000 of results returned at offset 17\n",
      "20000 of results returned at offset 18\n",
      "20000 of results returned at offset 19\n",
      "20000 of results returned at offset 20\n",
      "20000 of results returned at offset 21\n",
      "20000 of results returned at offset 22\n",
      "20000 of results returned at offset 23\n",
      "20000 of results returned at offset 24\n",
      "20000 of results returned at offset 25\n",
      "20000 of results returned at offset 26\n",
      "20000 of results returned at offset 27\n",
      "20000 of results returned at offset 28\n",
      "20000 of results returned at offset 29\n",
      "20000 of results returned at offset 30\n",
      "20000 of results returned at offset 31\n",
      "20000 of results returned at offset 32\n",
      "20000 of results returned at offset 33\n",
      "20000 of results returned at offset 34\n",
      "20000 of results returned at offset 35\n",
      "20000 of results returned at offset 36\n",
      "20000 of results returned at offset 37\n",
      "20000 of results returned at offset 38\n",
      "20000 of results returned at offset 39\n",
      "20000 of results returned at offset 40\n",
      "20000 of results returned at offset 41\n",
      "20000 of results returned at offset 42\n",
      "20000 of results returned at offset 43\n",
      "20000 of results returned at offset 44\n",
      "20000 of results returned at offset 45\n",
      "20000 of results returned at offset 46\n",
      "32 of results returned at offset 47\n",
      "No more results returned (offset 48)\n",
      "Name Q82799\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q82799.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "6626 of results returned at offset 2\n",
      "No more results returned (offset 3)\n",
      "Artist Q483501\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q483501.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "175 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "Geolocation Q2221906\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q2221906.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "20000 of results returned at offset 2\n",
      "20000 of results returned at offset 3\n",
      "20000 of results returned at offset 4\n",
      "20000 of results returned at offset 5\n",
      "20000 of results returned at offset 6\n",
      "20000 of results returned at offset 7\n",
      "20000 of results returned at offset 8\n",
      "20000 of results returned at offset 9\n",
      "20000 of results returned at offset 10\n",
      "20000 of results returned at offset 11\n",
      "20000 of results returned at offset 12\n",
      "20000 of results returned at offset 13\n",
      "20000 of results returned at offset 14\n",
      "20000 of results returned at offset 15\n",
      "20000 of results returned at offset 16\n",
      "20000 of results returned at offset 17\n",
      "20000 of results returned at offset 18\n",
      "20000 of results returned at offset 19\n",
      "20000 of results returned at offset 20\n",
      "20000 of results returned at offset 21\n",
      "20000 of results returned at offset 22\n",
      "20000 of results returned at offset 23\n",
      "20000 of results returned at offset 24\n",
      "20000 of results returned at offset 25\n",
      "20000 of results returned at offset 26\n",
      "20000 of results returned at offset 27\n",
      "20000 of results returned at offset 28\n",
      "20000 of results returned at offset 29\n",
      "20000 of results returned at offset 30\n",
      "20000 of results returned at offset 31\n",
      "20000 of results returned at offset 32\n",
      "20000 of results returned at offset 33\n",
      "20000 of results returned at offset 34\n",
      "20000 of results returned at offset 35\n",
      "20000 of results returned at offset 36\n",
      "20000 of results returned at offset 37\n",
      "20000 of results returned at offset 38\n",
      "20000 of results returned at offset 39\n",
      "20000 of results returned at offset 40\n",
      "20000 of results returned at offset 41\n",
      "20000 of results returned at offset 42\n",
      "20000 of results returned at offset 43\n",
      "20000 of results returned at offset 44\n",
      "20000 of results returned at offset 45\n",
      "20000 of results returned at offset 46\n",
      "20000 of results returned at offset 47\n",
      "20000 of results returned at offset 48\n",
      "20000 of results returned at offset 49\n",
      "20000 of results returned at offset 50\n",
      "20000 of results returned at offset 51\n",
      "20000 of results returned at offset 52\n",
      "20000 of results returned at offset 53\n",
      "20000 of results returned at offset 54\n",
      "20000 of results returned at offset 55\n",
      "20000 of results returned at offset 56\n",
      "20000 of results returned at offset 57\n",
      "20000 of results returned at offset 58\n",
      "20000 of results returned at offset 59\n",
      "20000 of results returned at offset 60\n",
      "20000 of results returned at offset 61\n",
      "20000 of results returned at offset 62\n",
      "20000 of results returned at offset 63\n",
      "20000 of results returned at offset 64\n",
      "20000 of results returned at offset 65\n",
      "20000 of results returned at offset 66\n",
      "20000 of results returned at offset 67\n",
      "20000 of results returned at offset 68\n",
      "20000 of results returned at offset 69\n",
      "20000 of results returned at offset 70\n",
      "20000 of results returned at offset 71\n",
      "20000 of results returned at offset 72\n",
      "20000 of results returned at offset 73\n",
      "20000 of results returned at offset 74\n",
      "20000 of results returned at offset 75\n",
      "20000 of results returned at offset 76\n",
      "20000 of results returned at offset 77\n",
      "20000 of results returned at offset 78\n",
      "20000 of results returned at offset 79\n",
      "20000 of results returned at offset 80\n",
      "20000 of results returned at offset 81\n",
      "20000 of results returned at offset 82\n",
      "20000 of results returned at offset 83\n",
      "20000 of results returned at offset 84\n",
      "20000 of results returned at offset 85\n",
      "20000 of results returned at offset 86\n",
      "20000 of results returned at offset 87\n",
      "20000 of results returned at offset 88\n",
      "20000 of results returned at offset 89\n",
      "20000 of results returned at offset 90\n",
      "20000 of results returned at offset 91\n",
      "20000 of results returned at offset 92\n",
      "20000 of results returned at offset 93\n",
      "20000 of results returned at offset 94\n",
      "20000 of results returned at offset 95\n",
      "20000 of results returned at offset 96\n",
      "20000 of results returned at offset 97\n",
      "20000 of results returned at offset 98\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20000 of results returned at offset 99\n",
      "20000 of results returned at offset 100\n",
      "20000 of results returned at offset 101\n",
      "20000 of results returned at offset 102\n",
      "20000 of results returned at offset 103\n",
      "20000 of results returned at offset 104\n",
      "20000 of results returned at offset 105\n",
      "20000 of results returned at offset 106\n",
      "20000 of results returned at offset 107\n",
      "20000 of results returned at offset 108\n",
      "20000 of results returned at offset 109\n",
      "20000 of results returned at offset 110\n",
      "20000 of results returned at offset 111\n",
      "20000 of results returned at offset 112\n",
      "20000 of results returned at offset 113\n",
      "20000 of results returned at offset 114\n",
      "20000 of results returned at offset 115\n",
      "20000 of results returned at offset 116\n",
      "20000 of results returned at offset 117\n",
      "20000 of results returned at offset 118\n",
      "20000 of results returned at offset 119\n",
      "20000 of results returned at offset 120\n",
      "20000 of results returned at offset 121\n",
      "20000 of results returned at offset 122\n",
      "20000 of results returned at offset 123\n",
      "20000 of results returned at offset 124\n",
      "20000 of results returned at offset 125\n",
      "20000 of results returned at offset 126\n",
      "20000 of results returned at offset 127\n",
      "20000 of results returned at offset 128\n",
      "20000 of results returned at offset 129\n",
      "20000 of results returned at offset 130\n",
      "20000 of results returned at offset 131\n",
      "20000 of results returned at offset 132\n",
      "20000 of results returned at offset 133\n",
      "20000 of results returned at offset 134\n",
      "20000 of results returned at offset 135\n",
      "20000 of results returned at offset 136\n",
      "20000 of results returned at offset 137\n",
      "20000 of results returned at offset 138\n",
      "20000 of results returned at offset 139\n",
      "20000 of results returned at offset 140\n",
      "20000 of results returned at offset 141\n",
      "20000 of results returned at offset 142\n",
      "20000 of results returned at offset 143\n",
      "20000 of results returned at offset 144\n",
      "20000 of results returned at offset 145\n",
      "20000 of results returned at offset 146\n",
      "20000 of results returned at offset 147\n",
      "20000 of results returned at offset 148\n",
      "20000 of results returned at offset 149\n",
      "20000 of results returned at offset 150\n",
      "20000 of results returned at offset 151\n",
      "20000 of results returned at offset 152\n",
      "20000 of results returned at offset 153\n",
      "20000 of results returned at offset 154\n",
      "4129 of results returned at offset 155\n",
      "No more results returned (offset 156)\n",
      "City Q515\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q515.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "8038 of results returned at offset 2\n",
      "No more results returned (offset 3)\n",
      "Capital Q5119\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q5119.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "588 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "Town Q3957\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q3957.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "20000 of results returned at offset 2\n",
      "4671 of results returned at offset 3\n",
      "No more results returned (offset 4)\n",
      "Demonym Q217438\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q217438.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "618 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "Product Q2424752\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q2424752.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "20000 of results returned at offset 2\n",
      "20000 of results returned at offset 3\n",
      "7102 of results returned at offset 4\n",
      "No more results returned (offset 5)\n",
      "Brand Q431289\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q431289.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "5359 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "Georegion Q82794\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q82794.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "20000 of results returned at offset 1\n",
      "20000 of results returned at offset 2\n",
      "20000 of results returned at offset 3\n",
      "20000 of results returned at offset 4\n",
      "20000 of results returned at offset 5\n",
      "20000 of results returned at offset 6\n",
      "20000 of results returned at offset 7\n",
      "20000 of results returned at offset 8\n",
      "20000 of results returned at offset 9\n",
      "20000 of results returned at offset 10\n",
      "20000 of results returned at offset 11\n",
      "20000 of results returned at offset 12\n",
      "20000 of results returned at offset 13\n",
      "20000 of results returned at offset 14\n",
      "20000 of results returned at offset 15\n",
      "20000 of results returned at offset 16\n",
      "20000 of results returned at offset 17\n",
      "20000 of results returned at offset 18\n",
      "20000 of results returned at offset 19\n",
      "20000 of results returned at offset 20\n",
      "20000 of results returned at offset 21\n",
      "20000 of results returned at offset 22\n",
      "20000 of results returned at offset 23\n",
      "20000 of results returned at offset 24\n",
      "20000 of results returned at offset 25\n",
      "20000 of results returned at offset 26\n",
      "20000 of results returned at offset 27\n",
      "20000 of results returned at offset 28\n",
      "20000 of results returned at offset 29\n",
      "20000 of results returned at offset 30\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20000 of results returned at offset 31\n",
      "20000 of results returned at offset 32\n",
      "20000 of results returned at offset 33\n",
      "20000 of results returned at offset 34\n",
      "20000 of results returned at offset 35\n",
      "20000 of results returned at offset 36\n",
      "20000 of results returned at offset 37\n",
      "20000 of results returned at offset 38\n",
      "20000 of results returned at offset 39\n",
      "20000 of results returned at offset 40\n",
      "20000 of results returned at offset 41\n",
      "20000 of results returned at offset 42\n",
      "20000 of results returned at offset 43\n",
      "20000 of results returned at offset 44\n",
      "20000 of results returned at offset 45\n",
      "20000 of results returned at offset 46\n",
      "20000 of results returned at offset 47\n",
      "20000 of results returned at offset 48\n",
      "20000 of results returned at offset 49\n",
      "20000 of results returned at offset 50\n",
      "20000 of results returned at offset 51\n",
      "20000 of results returned at offset 52\n",
      "20000 of results returned at offset 53\n",
      "20000 of results returned at offset 54\n",
      "20000 of results returned at offset 55\n",
      "20000 of results returned at offset 56\n",
      "20000 of results returned at offset 57\n",
      "20000 of results returned at offset 58\n",
      "20000 of results returned at offset 59\n",
      "20000 of results returned at offset 60\n",
      "20000 of results returned at offset 61\n",
      "20000 of results returned at offset 62\n",
      "20000 of results returned at offset 63\n",
      "20000 of results returned at offset 64\n",
      "20000 of results returned at offset 65\n",
      "20000 of results returned at offset 66\n",
      "20000 of results returned at offset 67\n",
      "20000 of results returned at offset 68\n",
      "20000 of results returned at offset 69\n",
      "20000 of results returned at offset 70\n",
      "20000 of results returned at offset 71\n",
      "20000 of results returned at offset 72\n",
      "20000 of results returned at offset 73\n",
      "20000 of results returned at offset 74\n",
      "20000 of results returned at offset 75\n",
      "20000 of results returned at offset 76\n",
      "20000 of results returned at offset 77\n",
      "20000 of results returned at offset 78\n",
      "20000 of results returned at offset 79\n",
      "20000 of results returned at offset 80\n",
      "20000 of results returned at offset 81\n",
      "20000 of results returned at offset 82\n",
      "20000 of results returned at offset 83\n",
      "20000 of results returned at offset 84\n",
      "12939 of results returned at offset 85\n",
      "No more results returned (offset 86)\n",
      "Country Q6256\n",
      "\n",
      "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
      "                    WHERE\n",
      "                    {\n",
      "                      {\n",
      "                        SELECT DISTINCT ?entity WHERE {\n",
      "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:Q6256.\n",
      "                        }\n",
      "                        OFFSET 0\n",
      "                        LIMIT 20000\n",
      "                      }\n",
      "                      SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n",
      "                    }\n",
      "                    \n",
      "396 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# From https://www.wikidata.org/wiki/Wikidata:SPARQL_query_service/queries/examples#Cats\n",
    "results = {}\n",
    "limit = 20000\n",
    "\n",
    "for label, wikidata_code in tqdm(classes.items()):\n",
    "    print(label, wikidata_code)\n",
    "    results[label] = []\n",
    "    offset = 0\n",
    "    while True:\n",
    "        try:\n",
    "             #  ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
    "            query = \"\"\"\n",
    "                    SELECT DISTINCT ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
    "                    WHERE\n",
    "                    {{\n",
    "                      {{\n",
    "                        SELECT DISTINCT ?entity WHERE {{\n",
    "                          ?entity wdt:P31|wdt:P31/wdt:P279|wdt:P31/wdt:P279/wdt:P279 wd:{};\n",
    "                                  wdt:P31 ?class\n",
    "                        }}\n",
    "                        OFFSET {}\n",
    "                        LIMIT {}\n",
    "                      }}\n",
    "                      SERVICE wikibase:label {{ bd:serviceParam wikibase:language 'en' }}\n",
    "                    }}\n",
    "                    \"\"\".format(wikidata_code, offset*limit, limit)\n",
    "            if offset == 0:\n",
    "                print(query)\n",
    "            sparql.setQuery(query)\n",
    "            sparql.setReturnFormat(JSON)\n",
    "            offset += 1\n",
    "            if len(sparql.query().convert()['results']['bindings']) > 0:\n",
    "                result = sparql.query().convert()['results']['bindings']\n",
    "                results[label].append(result)\n",
    "                print(f'{len(results[label][-1])} of results returned at offset {offset}')\n",
    "            else:\n",
    "                print(f'No more results returned (offset {offset})')\n",
    "                break\n",
    "        except Exception as e:\n",
    "            print(f'Exception at label {label} (offset {offset}) : {e}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for label in classes:\n",
    "    print(label.upper())\n",
    "    print(len(results[label]), 'results')\n",
    "    print(len(results_2[label]), 'results')\n",
    "    print(0 if label not in results_3 else len(results_3[label]), 'results')\n",
    "    print('')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ORGANIZATION\n",
      "About 940000 results\n",
      "\n",
      "NAME\n",
      "About 40000 results\n",
      "\n",
      "ARTIST\n",
      "About 20000 results\n",
      "\n",
      "GEOLOCATION\n",
      "About 3100000 results\n",
      "\n",
      "CITY\n",
      "About 40000 results\n",
      "\n",
      "CAPITAL\n",
      "About 20000 results\n",
      "\n",
      "TOWN\n",
      "About 60000 results\n",
      "\n",
      "DEMONYM\n",
      "About 20000 results\n",
      "\n",
      "PRODUCT\n",
      "About 80000 results\n",
      "\n",
      "BRAND\n",
      "About 20000 results\n",
      "\n",
      "GEOREGION\n",
      "About 1700000 results\n",
      "\n",
      "COUNTRY\n",
      "About 20000 results\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for label in classes:\n",
    "    print(label.upper())\n",
    "    print('About', len(results[label]) * limit, 'results')\n",
    "    print('')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "# v1.0 working with {0,2}\n",
    "# v1.1 adding classes QID\n",
    "pickle.dump(results, open('gazetteers_v1.1_results.pickle', 'wb'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "SELECT distinct  ?entity (GROUP_CONCAT(?class ; SEPARATOR = ';') as ?classes)\n",
    "WHERE \n",
    "{ \n",
    "     ?entity wdt:P31/wdt:P279* wd:Q82799;\n",
    "             wdt:P31 ?class.\n",
    "}\n",
    "GROUP BY ?entity\n",
    "LIMIT 100\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "171dd1314462483695a3009a898f6c8e",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=12.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Organization Q43229\n",
      "Name Q82799\n",
      "Artist Q483501\n",
      "Geolocation Q2221906\n",
      "\n",
      "                    SELECT distinct  ?entity (GROUP_CONCAT(?class ; SEPARATOR = ';') as ?classes)\n",
      "                    WHERE \n",
      "                    {\n",
      "                         ?entity wdt:P31|wdt:P31/wdt:P279 wd:Q2221906;\n",
      "                                 wdt:P31 ?class.\n",
      "                    }\n",
      "                    GROUP BY ?entity\n",
      "                    OFFSET 0\n",
      "                    LIMIT 10000\n",
      "                    \n",
      "10000 of results returned at offset 1\n",
      "10000 of results returned at offset 2\n",
      "10000 of results returned at offset 3\n",
      "10000 of results returned at offset 4\n",
      "10000 of results returned at offset 5\n",
      "10000 of results returned at offset 6\n",
      "10000 of results returned at offset 7\n",
      "10000 of results returned at offset 8\n",
      "10000 of results returned at offset 9\n",
      "10000 of results returned at offset 10\n",
      "10000 of results returned at offset 11\n",
      "10000 of results returned at offset 12\n",
      "10000 of results returned at offset 13\n",
      "10000 of results returned at offset 14\n",
      "10000 of results returned at offset 15\n",
      "Exception at label Geolocation (offset 15) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 16\n",
      "10000 of results returned at offset 17\n",
      "10000 of results returned at offset 18\n",
      "10000 of results returned at offset 19\n",
      "10000 of results returned at offset 20\n",
      "10000 of results returned at offset 21\n",
      "10000 of results returned at offset 22\n",
      "10000 of results returned at offset 23\n",
      "10000 of results returned at offset 24\n",
      "10000 of results returned at offset 25\n",
      "10000 of results returned at offset 26\n",
      "10000 of results returned at offset 27\n",
      "10000 of results returned at offset 28\n",
      "10000 of results returned at offset 29\n",
      "10000 of results returned at offset 30\n",
      "10000 of results returned at offset 31\n",
      "10000 of results returned at offset 32\n",
      "10000 of results returned at offset 33\n",
      "10000 of results returned at offset 34\n",
      "10000 of results returned at offset 35\n",
      "10000 of results returned at offset 36\n",
      "Exception at label Geolocation (offset 36) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 37\n",
      "10000 of results returned at offset 38\n",
      "Exception at label Geolocation (offset 39) : Remote end closed connection without response\n",
      "Exception at label Geolocation (offset 39) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 40\n",
      "10000 of results returned at offset 41\n",
      "10000 of results returned at offset 42\n",
      "10000 of results returned at offset 43\n",
      "10000 of results returned at offset 44\n",
      "Exception at label Geolocation (offset 45) : Remote end closed connection without response\n",
      "10000 of results returned at offset 46\n",
      "10000 of results returned at offset 47\n",
      "10000 of results returned at offset 48\n",
      "Exception at label Geolocation (offset 49) : Remote end closed connection without response\n",
      "10000 of results returned at offset 50\n",
      "10000 of results returned at offset 51\n",
      "Exception at label Geolocation (offset 52) : Remote end closed connection without response\n",
      "Exception at label Geolocation (offset 52) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 53\n",
      "10000 of results returned at offset 54\n",
      "10000 of results returned at offset 55\n",
      "10000 of results returned at offset 56\n",
      "10000 of results returned at offset 57\n",
      "Exception at label Geolocation (offset 57) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 58) : HTTP Error 504: Gateway Timeout\n",
      "10000 of results returned at offset 59\n",
      "10000 of results returned at offset 60\n",
      "10000 of results returned at offset 61\n",
      "10000 of results returned at offset 62\n",
      "10000 of results returned at offset 63\n",
      "10000 of results returned at offset 64\n",
      "10000 of results returned at offset 65\n",
      "10000 of results returned at offset 66\n",
      "10000 of results returned at offset 67\n",
      "Exception at label Geolocation (offset 67) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 68\n",
      "Exception at label Geolocation (offset 68) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 69\n",
      "10000 of results returned at offset 70\n",
      "10000 of results returned at offset 71\n",
      "10000 of results returned at offset 72\n",
      "10000 of results returned at offset 73\n",
      "10000 of results returned at offset 74\n",
      "10000 of results returned at offset 75\n",
      "10000 of results returned at offset 76\n",
      "Exception at label Geolocation (offset 76) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 77\n",
      "10000 of results returned at offset 78\n",
      "10000 of results returned at offset 79\n",
      "Exception at label Geolocation (offset 79) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 80\n",
      "Exception at label Geolocation (offset 81) : Remote end closed connection without response\n",
      "10000 of results returned at offset 82\n",
      "10000 of results returned at offset 83\n",
      "10000 of results returned at offset 84\n",
      "Exception at label Geolocation (offset 85) : Remote end closed connection without response\n",
      "10000 of results returned at offset 86\n",
      "10000 of results returned at offset 87\n",
      "10000 of results returned at offset 88\n",
      "Exception at label Geolocation (offset 89) : Remote end closed connection without response\n",
      "10000 of results returned at offset 90\n",
      "10000 of results returned at offset 91\n",
      "10000 of results returned at offset 92\n",
      "10000 of results returned at offset 93\n",
      "10000 of results returned at offset 94\n",
      "10000 of results returned at offset 95\n",
      "10000 of results returned at offset 96\n",
      "10000 of results returned at offset 97\n",
      "10000 of results returned at offset 98\n",
      "10000 of results returned at offset 99\n",
      "10000 of results returned at offset 100\n",
      "10000 of results returned at offset 101\n",
      "10000 of results returned at offset 102\n",
      "10000 of results returned at offset 103\n",
      "10000 of results returned at offset 104\n",
      "10000 of results returned at offset 105\n",
      "10000 of results returned at offset 106\n",
      "Exception at label Geolocation (offset 107) : Remote end closed connection without response\n",
      "10000 of results returned at offset 108\n",
      "Exception at label Geolocation (offset 108) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 108) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 109\n",
      "Exception at label Geolocation (offset 110) : Remote end closed connection without response\n",
      "10000 of results returned at offset 111\n",
      "Exception at label Geolocation (offset 112) : Remote end closed connection without response\n",
      "Exception at label Geolocation (offset 113) : Remote end closed connection without response\n",
      "10000 of results returned at offset 114\n",
      "10000 of results returned at offset 115\n",
      "10000 of results returned at offset 116\n",
      "10000 of results returned at offset 117\n",
      "10000 of results returned at offset 118\n",
      "Exception at label Geolocation (offset 118) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 118) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 119\n",
      "10000 of results returned at offset 120\n",
      "10000 of results returned at offset 121\n",
      "10000 of results returned at offset 122\n",
      "Exception at label Geolocation (offset 122) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 122) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 123\n",
      "Exception at label Geolocation (offset 124) : Remote end closed connection without response\n",
      "Exception at label Geolocation (offset 124) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 125\n",
      "Exception at label Geolocation (offset 125) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 126\n",
      "Exception at label Geolocation (offset 126) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 127\n",
      "10000 of results returned at offset 128\n",
      "Exception at label Geolocation (offset 128) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 128) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 129\n",
      "Exception at label Geolocation (offset 129) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 129) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 130\n",
      "Exception at label Geolocation (offset 130) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 130) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 131\n",
      "10000 of results returned at offset 132\n",
      "Exception at label Geolocation (offset 132) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 132) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 132) : Wikidata TimeoutException\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Exception at label Geolocation (offset 132) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 133) : Remote end closed connection without response\n",
      "10000 of results returned at offset 134\n",
      "Exception at label Geolocation (offset 134) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 135\n",
      "Exception at label Geolocation (offset 135) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 135) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 136\n",
      "10000 of results returned at offset 137\n",
      "Exception at label Geolocation (offset 137) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 138\n",
      "10000 of results returned at offset 139\n",
      "Exception at label Geolocation (offset 139) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 139) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 139) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 140\n",
      "Exception at label Geolocation (offset 140) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 141\n",
      "10000 of results returned at offset 142\n",
      "10000 of results returned at offset 143\n",
      "Exception at label Geolocation (offset 143) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 144\n",
      "10000 of results returned at offset 145\n",
      "10000 of results returned at offset 146\n",
      "Exception at label Geolocation (offset 146) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 147\n",
      "10000 of results returned at offset 148\n",
      "Exception at label Geolocation (offset 148) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 149\n",
      "10000 of results returned at offset 150\n",
      "10000 of results returned at offset 151\n",
      "Exception at label Geolocation (offset 151) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 152\n",
      "Exception at label Geolocation (offset 152) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 152) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 153\n",
      "10000 of results returned at offset 154\n",
      "10000 of results returned at offset 155\n",
      "10000 of results returned at offset 156\n",
      "10000 of results returned at offset 157\n",
      "Exception at label Geolocation (offset 157) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 157) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 158\n",
      "Exception at label Geolocation (offset 158) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 158) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 159\n",
      "10000 of results returned at offset 160\n",
      "10000 of results returned at offset 161\n",
      "Exception at label Geolocation (offset 161) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 162\n",
      "10000 of results returned at offset 163\n",
      "Exception at label Geolocation (offset 163) : Wikidata TimeoutException\n",
      "10000 of results returned at offset 164\n",
      "Exception at label Geolocation (offset 164) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 164) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 164) : Wikidata TimeoutException\n",
      "Exception at label Geolocation (offset 164) : Wikidata TimeoutException\n",
      "8383 of results returned at offset 165\n",
      "Exception at label Geolocation (offset 165) : Wikidata TimeoutException\n",
      "No more results returned (offset 166)\n",
      "City Q515\n",
      "Capital Q5119\n",
      "Town Q3957\n",
      "Demonym Q217438\n",
      "Product Q2424752\n",
      "Brand Q431289\n",
      "Georegion Q82794\n",
      "\n",
      "                    SELECT distinct  ?entity (GROUP_CONCAT(?class ; SEPARATOR = ';') as ?classes)\n",
      "                    WHERE \n",
      "                    {\n",
      "                         ?entity wdt:P31|wdt:P31/wdt:P279 wd:Q82794;\n",
      "                                 wdt:P31 ?class.\n",
      "                    }\n",
      "                    GROUP BY ?entity\n",
      "                    OFFSET 0\n",
      "                    LIMIT 10000\n",
      "                    \n",
      "10000 of results returned at offset 1\n",
      "10000 of results returned at offset 2\n",
      "10000 of results returned at offset 3\n",
      "10000 of results returned at offset 4\n",
      "10000 of results returned at offset 5\n",
      "10000 of results returned at offset 6\n",
      "10000 of results returned at offset 7\n",
      "10000 of results returned at offset 8\n",
      "10000 of results returned at offset 9\n",
      "10000 of results returned at offset 10\n",
      "10000 of results returned at offset 11\n",
      "10000 of results returned at offset 12\n",
      "10000 of results returned at offset 13\n",
      "10000 of results returned at offset 14\n",
      "10000 of results returned at offset 15\n",
      "10000 of results returned at offset 16\n",
      "10000 of results returned at offset 17\n",
      "10000 of results returned at offset 18\n",
      "10000 of results returned at offset 19\n",
      "10000 of results returned at offset 20\n",
      "10000 of results returned at offset 21\n",
      "10000 of results returned at offset 22\n",
      "10000 of results returned at offset 23\n",
      "10000 of results returned at offset 24\n",
      "10000 of results returned at offset 25\n",
      "10000 of results returned at offset 26\n",
      "10000 of results returned at offset 27\n",
      "10000 of results returned at offset 28\n",
      "10000 of results returned at offset 29\n",
      "10000 of results returned at offset 30\n",
      "10000 of results returned at offset 31\n",
      "10000 of results returned at offset 32\n",
      "10000 of results returned at offset 33\n",
      "10000 of results returned at offset 34\n",
      "10000 of results returned at offset 35\n",
      "10000 of results returned at offset 36\n",
      "10000 of results returned at offset 37\n",
      "10000 of results returned at offset 38\n",
      "10000 of results returned at offset 39\n",
      "10000 of results returned at offset 40\n",
      "10000 of results returned at offset 41\n",
      "10000 of results returned at offset 42\n",
      "10000 of results returned at offset 43\n",
      "10000 of results returned at offset 44\n",
      "10000 of results returned at offset 45\n",
      "10000 of results returned at offset 46\n",
      "10000 of results returned at offset 47\n",
      "10000 of results returned at offset 48\n",
      "10000 of results returned at offset 49\n",
      "10000 of results returned at offset 50\n",
      "10000 of results returned at offset 51\n",
      "10000 of results returned at offset 52\n",
      "10000 of results returned at offset 53\n",
      "10000 of results returned at offset 54\n",
      "10000 of results returned at offset 55\n",
      "10000 of results returned at offset 56\n",
      "10000 of results returned at offset 57\n",
      "10000 of results returned at offset 58\n",
      "10000 of results returned at offset 59\n",
      "10000 of results returned at offset 60\n",
      "10000 of results returned at offset 61\n",
      "10000 of results returned at offset 62\n",
      "10000 of results returned at offset 63\n",
      "10000 of results returned at offset 64\n",
      "10000 of results returned at offset 65\n",
      "10000 of results returned at offset 66\n",
      "10000 of results returned at offset 67\n",
      "10000 of results returned at offset 68\n",
      "10000 of results returned at offset 69\n",
      "10000 of results returned at offset 70\n",
      "10000 of results returned at offset 71\n",
      "9716 of results returned at offset 72\n",
      "No more results returned (offset 73)\n",
      "Country Q6256\n",
      "\n",
      "                    SELECT distinct  ?entity (GROUP_CONCAT(?class ; SEPARATOR = ';') as ?classes)\n",
      "                    WHERE \n",
      "                    {\n",
      "                         ?entity wdt:P31|wdt:P31/wdt:P279 wd:Q6256;\n",
      "                                 wdt:P31 ?class.\n",
      "                    }\n",
      "                    GROUP BY ?entity\n",
      "                    OFFSET 0\n",
      "                    LIMIT 10000\n",
      "                    \n",
      "318 of results returned at offset 1\n",
      "No more results returned (offset 2)\n",
      "\n",
      "CPU times: user 49.2 s, sys: 7.89 s, total: 57.1 s\n",
      "Wall time: 6h 29min 29s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# From https://www.wikidata.org/wiki/Wikidata:SPARQL_query_service/queries/examples#Cats\n",
    "# results_classes = {}\n",
    "limit = 10000\n",
    "\n",
    "for label, wikidata_code in tqdm(classes.items()):\n",
    "    print(label, wikidata_code)\n",
    "    if label in ['Organization', 'Name', 'Artist', 'City', \"Capital\", 'Town', 'Demonym', \"Product\", \n",
    "                 'Brand']:\n",
    "        continue\n",
    "    results_classes[label] = []\n",
    "    offset = 0\n",
    "    while True:\n",
    "        try:\n",
    "             #  ?entity ?entityLabel ?entityAltLabel ?entityDescription\n",
    "            query = \"\"\"\n",
    "                    SELECT distinct  ?entity (GROUP_CONCAT(?class ; SEPARATOR = ';') as ?classes)\n",
    "                    WHERE \n",
    "                    {{\n",
    "                         ?entity wdt:P31|wdt:P31/wdt:P279 wd:{};\n",
    "                                 wdt:P31 ?class.\n",
    "                    }}\n",
    "                    GROUP BY ?entity\n",
    "                    OFFSET {}\n",
    "                    LIMIT {}\n",
    "                    \"\"\".format(wikidata_code, offset*limit, limit)\n",
    "            if offset == 0:\n",
    "                print(query)\n",
    "            sparql.setQuery(query)\n",
    "            sparql.setReturnFormat(JSON)\n",
    "            offset += 1\n",
    "            if len(sparql.query().convert()['results']['bindings']) > 0:\n",
    "                result = sparql.query().convert()['results']['bindings']\n",
    "                results_classes[label].append(result)\n",
    "                print(f'{len(results_classes[label][-1])} of results returned at offset {offset}')\n",
    "            else:\n",
    "                print(f'No more results returned (offset {offset})')\n",
    "                break\n",
    "        except Exception as e:\n",
    "            if str(e).startswith('EndPointInternalError'):\n",
    "                e = 'Wikidata TimeoutException'\n",
    "                offset -= 1\n",
    "                time.sleep(30)\n",
    "            print(f'Exception at label {label} (offset {offset}) : {e}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "pickle.dump(results_classes, open('results_classes.pickle', 'wb'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(results_classes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict_keys(['Organization', 'Name', 'Artist', 'Geolocation', 'City', 'Capital', 'Town', 'Demonym', 'Product', 'Brand', 'Georegion', 'Country'])"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results_classes.keys()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'entity': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q80443'},\n",
       " 'classes': {'type': 'literal',\n",
       "  'value': 'http://www.wikidata.org/entity/Q16521;http://www.wikidata.org/entity/Q1040689'}}"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results_classes['Name'][0][1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "091b32a6819a445883c6300ecac775ce",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=12.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "entity_classes_data = []\n",
    "\n",
    "for class_label in tqdm(results_classes):\n",
    "    results = [x for l in results_classes[class_label] for x in l]\n",
    "    for result in results:\n",
    "        entity_classes_data.append({\n",
    "            'entity_qid': result['entity']['value'].split('/')[-1],\n",
    "            'entity_classes': ';'.join([s.split('/')[-1] for s in result['classes']['value'].split(';')]),\n",
    "        })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>entity_qid</th>\n",
       "      <th>entity_classes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Q65968</td>\n",
       "      <td>Q164950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Q68330</td>\n",
       "      <td>Q11032;Q11032</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Q68682</td>\n",
       "      <td>Q7275;Q465613;Q3024240;Q7275;Q465613;Q3024240;...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Q69119</td>\n",
       "      <td>Q7278;Q7278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Q70738</td>\n",
       "      <td>Q7278;Q7278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3321818</th>\n",
       "      <td>Q224</td>\n",
       "      <td>Q6256;Q179164;Q3624078;Q51576574;Q6256;Q179164...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3321819</th>\n",
       "      <td>Q225</td>\n",
       "      <td>Q3624078</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3321820</th>\n",
       "      <td>Q230</td>\n",
       "      <td>Q3624078</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3321821</th>\n",
       "      <td>Q228</td>\n",
       "      <td>Q3624078</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3321822</th>\n",
       "      <td>Q229</td>\n",
       "      <td>Q3624078</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3321823 rows  2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        entity_qid                                     entity_classes\n",
       "0           Q65968                                            Q164950\n",
       "1           Q68330                                      Q11032;Q11032\n",
       "2           Q68682  Q7275;Q465613;Q3024240;Q7275;Q465613;Q3024240;...\n",
       "3           Q69119                                        Q7278;Q7278\n",
       "4           Q70738                                        Q7278;Q7278\n",
       "...            ...                                                ...\n",
       "3321818       Q224  Q6256;Q179164;Q3624078;Q51576574;Q6256;Q179164...\n",
       "3321819       Q225                                           Q3624078\n",
       "3321820       Q230                                           Q3624078\n",
       "3321821       Q228                                           Q3624078\n",
       "3321822       Q229                                           Q3624078\n",
       "\n",
       "[3321823 rows x 2 columns]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_entity_classes = pd.DataFrame(entity_classes_data)\n",
    "df_entity_classes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_entity_classes.to_csv('csv/entity_classes.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
